/* 绘画与修饰工具 */

污点修复、修复、修补工具



//画笔工具

正片叠底	去除白色
滤色		去除黑色

叠加		类似幻灯片叠加
柔光		锐化:柔光专门屏蔽中性灰
	
差值		负片反相效果	用于档案解密、背景分析
排除

色相		锁定色相画笔修饰
饱和度		锁定饱和度画笔修饰
亮度		锁定亮度画笔修饰

颜色		给黑白片着色


//颜色替换工具

色相		锁定色相画笔修饰
饱和度		锁定饱和度画笔修饰
亮度		锁定亮度画笔修饰

//渐变工具
渐变调色
通道蒙版使用渐变控制调色范围

//减淡工具
人物皮肤提亮
//加深工具
加重颜色
//海绵工具
调整颜色饱和度

//颜色通道
记录颜色信息

//alpha通道
记录选区信息	用于保存选区
选择---存储选区

//图层蒙版
控制图层选区范围



//色阶
吸管定义黑场白场

//曲线
曲线更精细调节

//色相饱和度
色相条 输入、输出	主体颜色、颜色容差值

//色彩平衡
调节片子偏冷偏暖




//图层

//混合颜色带
alt + 三角  融合

//添加剪贴蒙版
把上一个图层的内容放到下一个图层的形状中去
alt


// 降噪
暗部	亮部噪点/颜色噪点

减少杂色功能:明亮度/颜色 + 暗部
锐化:蒙版+option	锐化边缘选择